app/models/shortened_url.rb

  def self.prune(n)
    time_ago = n.minutes.ago

    ShortenedUrl
      .joins('LEFT JOIN visits ON visits.short_url_id = shortened_urls.id')
      .joins('JOIN users ON shortened_urls.user_id = users.id')
      .where('visits.created_at < ? OR (visits.id IS NULL AND shortened_urls.created_at < ?)', time_ago, time_ago)
      .where('users.premium': false)
      .destroy_all
---
INSERT INTO "shortened_urls" ("user_id", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 26], ["long_url", "11111111111111"], ["short_url", "YKLlZiCeERN23yOaLH0YRw"], ["created_at", "2020-08-31 06:53:00.597063"], ["updated_at", "2020-08-31 06:53:00.597063"]]

  def self.random_code
    str = nil

    loop do
      str = SecureRandom.urlsafe_base64

      break unless ShortenedUrl.exists?(short_url: str)
---
SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "rRlOpuek5JE439rXQS3Dmw"], ["LIMIT", 1]]

  def self.create_shortened_url(user, long_url)
    shortened_url = ShortenedUrl.random_code
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: shortened_url)
---
INSERT INTO "shortened_urls" ("user_id", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 56], ["long_url", "11111111111111"], ["short_url", "Bv93EAijukl5PH0kJl39PA"], ["created_at", "2020-09-01 02:57:42.624619"], ["updated_at", "2020-09-01 02:57:42.624619"]]
INSERT INTO "shortened_urls" ("user_id", "long_url", "short_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 88], ["long_url", "11111111111111"], ["short_url", "rRlOpuek5JE439rXQS3Dmw"], ["created_at", "2020-09-01 06:01:58.737853"], ["updated_at", "2020-09-01 06:01:58.737853"]]

  def no_spamming
    max_link_count = ShortenedUrl
      .where(created_at: (Time.current - 1.minute)..(Time.current))
      .where(user_id: user_id)
      .count >= 5
---
SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."created_at" BETWEEN $1 AND $2 AND "shortened_urls"."user_id" = $3  [["created_at", "2020-09-01 06:00:58.731168"], ["created_at", "2020-09-01 06:01:58.731241"], ["user_id", 88]]

  def nonpremium_max
    return if User.find(user_id).premium

    max_link_count = ShortenedUrl
      .where(user_id: user_id)
      .count >= 5
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 88], ["LIMIT", 1]]
SELECT COUNT(*) FROM "shortened_urls" WHERE "shortened_urls"."user_id" = $1  [["user_id", 88]]