app/models/visit.rb

  def self.record_visit!(user, short_url)
    Visit.create!(user_id: user.id, short_url_id: short_url.id)
---
INSERT INTO "visits" ("user_id", "short_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 26], ["short_url_id", 65], ["created_at", "2020-08-31 06:53:00.662062"], ["updated_at", "2020-08-31 06:53:00.662062"]]